CSI API ETABS v1
cCaseStaticNonlinearStaged.SetStageDefinitions_1 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetStageDefinitions_1(
	string Name,
	int NumberStages,
	ref int[] Duration,
	ref bool[] Output,
	ref string[] OutputName,
	ref string[] Comment
)
Function SetStageDefinitions_1 (
	Name As String,
	NumberStages As Integer,
	ByRef Duration As Integer(),
	ByRef Output As Boolean(),
	ByRef OutputName As String(),
	ByRef Comment As String()
) As Integer
Dim instance As cCaseStaticNonlinearStaged
Dim Name As String
Dim NumberStages As Integer
Dim Duration As Integer()
Dim Output As Boolean()
Dim OutputName As String()
Dim Comment As String()
Dim returnValue As Integer
returnValue = instance.SetStageDefinitions_1(Name,
	NumberStages, Duration, Output, OutputName,
	Comment)
int SetStageDefinitions_1(
	String^ Name,
	int NumberStages,
	array<int>^% Duration,
	array<bool>^% Output,
	array<String^>^% OutputName,
	array<String^>^% Comment
)
abstract SetStageDefinitions_1 :
        Name : string *
        NumberStages : int *
        Duration : int[] byref *
        Output : bool[] byref *
        OutputName : string[] byref *
        Comment : string[] byref -> int
Parameters
Name
Type: System.String
NumberStages
Type: System.Int32
Duration
Type: System.Int32[]
Output
Type: System.Boolean[]
OutputName
Type: System.String[]
Comment
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinearStaged Interface
ETABSv1 Namespace